//? 30. Массивы, как свойства компонентов
//* - Массивы можно передавать как свойство
//* - В JSX можно вставлять массивы элементов(не только по одному)
//* - Можно передать ВСЕ свойства обьекта в компонент используя Object Spread(...array) не перечисляя каждого

//? 31. Коллекции и ключи
//* - Каждому JSX элементу в массиве нужно уникальное свойство "key"
//* - React использует "key" чтобы эффективно сравнивать элементы  при обновлении
//* - Не стоит делать ключи из индекса массива

//? 34. Компоненты-классы
//* - 
//* - 
//* - 

//? 
//* - 
//* - 
//* - 