//? 115. Введение в Redux
//* - Redux решает проблему управления состоянием в приложении
//* - Redux предлагат хранить state в одном "глобаном" объекте
//* - Функция "Reducer" обновляет глобальный state в ответ на "Actions"(события/действия)
//* - Объект "Store" координирует действия 

//? 117. Reducer
//* - Reducer это обычная функция = (STATE, ACTION) => newState
//* - Если STATE - undefined нужно вернуть первоначальный (initial) STATE
//* - Если тип ACTION - неизвестен - нужно вернуть STATE без изменений

//? 
//* - 
//* - 
//* - 

//? 
//* - 
//* - 
//* - 