//? 95. Что такое React Hooks (хуки)
//* - Хуки дают возможность компонентам-функциям работать со состоянием, жизненным циклом и контекстом.
//* - Работаю в версии React не ниже 16.8.0

//? 97. useState()
//* - Добавляет state в функциональный компонент
// const [ параметр, setПараметр ] = useState(стартовое_Значение)
//* - Возвращает массив: текущее значение и функция(setter) для установки значения
//* - Всегда обновляет обьект полностью, а не отдельные поля как setState()

//? 98. useContext()
//* - 
//* - 
//* - 